import { type Article } from "../types";

export const SHARED_DATA: Article[] = [
  {
    topic: "История",
    data: [
      {
        date: 1987,
        text: 'Июль 1987 год - Начало политики "перестройки" в СССР.',
      },
      {
        date: 1988,
        text: "14 мая 1988 года - начало вывода советских войск из Афганистана.",
      },
      {
        date: 1989,
        text: "2 декабря 1989 года - встреча Горбачева М.С. и Дж.Буша (старшего) на о. Мальта.",
      },
      {
        date: 1990,
        text: '13 августа 1990 года - Указ "О восстановлении прав всех жертв политических репрессий 20-50-х годов".',
      },
      {
        date: 1991,
        text: "8 декабря 1991 года - Подписание Беловежских соглашений о ликвидации СССР и создании СНГ.",
      },
    ],
  },
  {
    topic: "Наука",
    data: [
      {
        date: 1992,
        text: "1992 год был объявлен Организацией Объединённых Наций Международным годом космоса",
      },
      {
        date: 1995,
        text: "24 августа — выпуск в свет операционной системы Windows 95.",
      },
      {
        date: 1996,
        text: "30 января — японским астрономом-любителем Юдзи Хякутакэ (яп. 百武裕司) открыта долгопериодическая комета C/1996 B2 (Хякутакэ).",
      },
    ],
  },
  {
    topic: "Кино",
    data: [
      {
        date: 1999,
        text: "Брат. 100 мин.Россия • драма  Режиссёр: Алексей Балабанов.В ролях: Сергей Бодров мл., Виктор Сухоруков",
      },
      {
        date: 2000,
        text: "Шоу Трумана.The Truman Show. 103 мин.США • драма  Режиссёр: Питер Уир.В ролях: Джим Керри, Лора Линни",
      },
      {
        date: 2001,
        text: `Гарри Поттер и философский камень.Harry Potter and the Sorcerer's Stone, 2001, 152 мин.Великобритания • фэнтези  Режиссёр: Крис Коламбус.В ролях: Дэниэл Рэдклифф, Руперт Гринт`,
      },
      {
        date: 2002,
        text: "Поймай меня, если сможешь.Catch Me If You Can.2002, 141 мин.США • криминал  Режиссёр: Стивен Спилберг.В ролях: Леонардо ДиКаприо, Том Хэнкс",
      },
    ],
  },
  {
    topic: "Литература",
    data: [
      {
        date: 2003,
        text: "Дублинская литературная премия — Орхан Памук, роман «Меня зовут Красный»",
      },
      {
        date: 2005,
        text: "Премия Александра Солженицына — критик Игорь Золотусский, «за масштабность художественно-критических исследований современной словесности и глубинное постижение гения и судьбы Гоголя; за верность, в независимом поиске, традициям и нравственному достоинству русской литературы»",
      },
      {
        date: 2008,
        text: "Нобелевская премия по литературе — Жан-Мари Гюстав Леклезио, «За то, что Леклезио пишет „о новых направлениях, поэтических приключениях, чувственных восторгах“, он — „исследователь человечества вне пределов правящей цивилизации“»",
      },
    ],
  },
  {
    topic: "Технологии",
    data: [
      {
        date: 2011,
        text: "ГЛОНАСС накрыл всю планету",
      },
      {
        date: 2012,
        text: "2012 г. является запуск операционной системы Microsoft Windows 8",
      },
      {
        date: 2014,
        text: "5 января — группа астрофизиков обнаружила тройную систему звёзд PSR J0337+1715, строение которой позволяет с высокой точностью проверить сильный принцип эквивалентности Общей теории относительности Эйнштейна",
      },
      {
        date: 2015,
        text: "14 марта — хирурги в Южно-Африканской Республике провели первую в мире успешную операцию по пересадке пениса",
      },
    ],
  },
  {
    topic: "События",
    data: [
      {
        date: 2016,
        text: "С космодрома «Восточный» успешно запустили первую ракету.",
      },
      {
        date: 2018,
        text: "после завершения ЧМ-2018 состоялось одно из главных событий года в сфере политики – в столице Финляндии Хельсинки президент России Владимир Путин встретился со своим американским коллегой Дональдом Трампом",
      },
      {
        date: 2019,
        text: "Запуск железнодорожного сообщения через Крымский мост",
      },
      {
        date: 2020,
        text: "Год пандемии и локдаунов.Коронавирусная инфекция (COVID-19)",
      },
      {
        date: 2021,
        text: "штурма Капитолии США 6 января",
      },
    ],
  },
];
